%факти
име(мъж). име(жена). име(момче). име(момиче).
позиция(помощник). позиция(убиец). позиция(жертва). позиция(свидетел).
възраст('най-стар'). възраст('по-стар'). възраст('по-млад'). възраст('най-млад').
пол(мъжки). пол(женски).

unique([]):-!.
unique([Head|Tail]):- member(Head, Tail), !, fail; unique(Tail).

решение(Хора) :-
Хора = [човек(Име1, Позиция1, Пол1, Възраст1), човек(Име2, Позиция2, Пол2, Възраст2),
        човек(Име3, Позиция3, Пол1, Възраст3), човек(Име4, Позиция4, Пол2, Възраст4)],
име(Име1), име(Име2), име(Име3), име(Име4),
unique([Име1,Име2,Име3,Име4]),
позиция(Позиция1), позиция(Позиция2), позиция(Позиция3), позиция(Позиция4),
unique([Позиция1,Позиция2,Позиция3,Позиция4]),
възраст(Възраст1), възраст(Възраст2), възраст(Възраст3), възраст(Възраст4),
unique([Възраст1,Възраст2,Възраст3,Възраст4]),
пол(Пол1), пол(Пол2),
unique([Пол1,Пол2]),

member(човек(мъж, _, мъжки, _), Хора),
member(човек(жена, _, женски, _), Хора),
member(човек(момиче, _, женски, _), Хора),
member(човек(момче, _, мъжки, _), Хора),

/* Свидетелят и този, който е помогнал на убиеца, не са от един и същи пол. */
 member(човек(_, помощник, Пол1, _), Хора),
 member(човек(_, свидетел, Пол2, _), Хора),
/* Най-старият човек и свидетелят не са от един и същи пол. */
 member(човек(_, _, Пол1, 'най-стар'), Хора),
 member(човек(_, свидетел, Пол2, _), Хора),
 member(човек(_, помощник, Пол1, _), Хора),
/* Най-младият човек и жертвата не са от един и същи пол. */
 member(човек(_, жертва, Пол1, _), Хора),
 member(човек(_, _, Пол2, 'най-млад'), Хора),
 not(member(човек(_, жертва, _, 'най-млад'), Хора)),
/* Този, който е помогнал за убийството, е бил по-възрастен от жертвата. */
 not(member(човек(_, жертва, _, 'най-стар'), Хора)),
/* Мъжът е бил по-стар от жената. */
 member(човек(мъж, _, _, 'най-стар'), Хора),
 member(човек(жена, _, _, 'по-стар'), Хора),
/* Убиецът не е бил най-младият. */
not(member(човек(_, убиец, _, 'най-млад'), Хора)).
