камък(рубин). камък(сапфир). камък(перла).
символ(мъдрост). символ(здраве). символ(благополучие).
месец_камък(септември,Y):-not(Y=перла).
месец_камък(септември,Y):-not(Y=рубин).
месец_камък(юни,Z):- (Z=мъдрост).
месец_символ(юни,Z):-not(Z=благополучие).
месец_символ(юли,Z):-not(Z=мъдрост).
камък_символ(Y,Z):- Y=рубин, not(Z=здраве).
dif(Y1,Y2,Y3):- Y1\=Y2, Y1\=Y3, Y2\=Y3.
резултат(X1,Y1,Z1,X2,Y2,Z2,X3,Y3,Z3):-
X1=юни, X2=юли, X3=септември,
камък(Y1), камък(Y2), камък(Y3),
символ(Z1), символ(Z2), символ(Z3),
камък_символ(Y1,Z1),
месец_камък(X3,Y3), месец_символ(X1,Z1), месец_символ(X2,Z2),
dif(Y1,Y2,Y3), dif(Z1,Z2,Z3).
