/* Екскурзия до Пловдив
Студенти от Историческия факултет на Великотърновския университет
Асен, Васил, Мария и Елена решили да посетят и разгледат историческите 
забележителности на Пловдив като Европейска столица на културата. 
По пътя обаче се оказало, че четиримата трябва да пишат реферати 
за различни исторически периоди – тракийски, римски, български и възрожденски. 
Пловдив, като град с богата хилядолетна история давал възможност на всеки 
от тях да задоволи интереса си и да събере необходимата информация. 
Затова те решили да се разделят и да посетят различни музеи. 
Известни са следните факти:
1.	Васил решил да посети природонаучния музей в града, 
тъй като наскоро беше посетил града и вече беше събрал нужната му информация. 
2.	В историческия музей беше открита изложба от периода на Възраждането.
3.	Мария се интерисува от периода на Първата и Втора българска държава, 
а Елена ще пише реферат за тракийския период
4.	В етнографския музей в момента няма експонати от римския период
5.	В археологическия музей няма експонати от Първата и Втора 
българска държава и Възраждането.

Открийте кой студент кой музей е посетил и за кой исторически период ще пише реферат.
*/
:- use_rendering(table,[header(студент('Име', 'Музей', 'Период'))]).
%факти
име(асен). 
име(васил). 
име(мария).
име(елена).
музей(археологически).
музей(етнографски).
музей(исторически).
музей(природонаучен).
период(тракийски).
период(римски).
период(български). 
период(възраждане).
/* unique(List) – проверка за уникалност на отделните елементи - 
 имена, музеи и историчски периоди */
unique([]):-!.
unique([Head|Tail]):- member(Head, Tail), !, fail; unique(Tail).
% списък със студентите
решение(Студенти) :-
Студенти = [студент(Име1, Музей1, Период1), студент(Име2, Музей2, Период2),
            	        студент(Име3, Музей3, Период3), 
           студент(Име4, Музей4, Период4)],
име(Име1), име(Име2), име(Име3), име(Име4),
unique([Име1,Име2,Име3,Име4]),
музей(Музей1), музей(Музей2), музей(Музей3), музей(Музей4),
unique([Музей1,Музей2,Музей3,Музей4]),
период(Период1), период(Период2), период(Период3), период(Период4),
unique([Период1,Период2,Период3,Период4]),
/* Васил решил да посети природонаучния музей */
 member(студент(васил, природонаучен, Период1), Студенти),
/* В историческия музей е открита изложба на Възраждането */
  member(студент(Име2, исторически, възраждане), Студенти),
/* Мария се интерисува от периода на първата и втора българска държава */
member(студент(мария, Музей3, български), Студенти),
/* Елена ще пише реферат за тракийския период */
member(студент(елена, Музей4, тракийски), Студенти),
/* В етнографския музей в момента няма експонати от римския период */
not(member(студент(_,етнографски,римски), Студенти)),
/* в археологическия музей няма експонати от българския период и възраждането */
not(member(студент(_,археологически, български), Студенти)),
not(member(студент(_,археологически,възраждане), Студенти)).
% задаване формат, по който да се изведе списъка 
[студент(васил, _, _),студент(асен, _, _), 
студент(мария, _, _),студент(елена,_,_)].

%?- решение(Студенти)
